butok/FNET/fnet_demos/common/startup/startup_mk60n512/headers/MK60X256VMD100.h
/* CAN - Register array accessors */
#define CAN0_CS(index)                           CAN_CS_REG(CAN0_BASE_PTR,index)
#define CAN1_CS(index)                           CAN_CS_REG(CAN1_BASE_PTR,index)
#define CAN0_ID(index)                           CAN_ID_REG(CAN0_BASE_PTR,index)
#define CAN1_ID(index)                           CAN_ID_REG(CAN1_BASE_PTR,index)
#define CAN0_WORD0(index)                        CAN_WORD0_REG(CAN0_BASE_PTR,index)
#define CAN1_WORD0(index)                        CAN_WORD0_REG(CAN1_BASE_PTR,index)
#define CAN0_WORD1(index)                        CAN_WORD1_REG(CAN0_BASE_PTR,index)
#define CAN1_WORD1(index)                        CAN_WORD1_REG(CAN1_BASE_PTR,index)
#define CAN0_RXIMR(index)                        CAN_RXIMR_REG(CAN0_BASE_PTR,index)
#define CAN1_RXIMR(index)                        CAN_RXIMR_REG(CAN1_BASE_PTR,index)

/*! \} */ /* end of group CAN_Register_Accessor_Macros */


/*! \} */ /* end of group CAN_Peripheral */


/* ----------------------------------------------------------------------------
   -- CAU
   ---------------------------------------------------------------------------- */

/*! \addtogroup CAU_Peripheral CAU */
/*! \{ */

/*! CAU - Peripheral register structure */
typedef struct CAU_MemMap
{
    uint32_t CASR;                                   /*!< Status Register, offset: 0x0 */
    uint32_t CAA;                                    /*!< Accumulator, offset: 0x4 */
    uint32_t CA[9];                                  /*!< General Purpose Register, array offset: 0x8, array step: 0x4 */
} volatile *CAU_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- CAU - Register accessor macros
   ---------------------------------------------------------------------------- */

/*! \addtogroup CAU_Register_Accessor_Macros CAU - Register accessor macros */
/*! \{ */


/* CAU - Register accessors */
#define CAU_CASR_REG(base)                       ((base)->CASR)
#define CAU_CAA_REG(base)                        ((base)->CAA)
#define CAU_CA_REG(base,index)                   ((base)->CA[index])

/*! \} */ /* end of group CAU_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- CAU Register Masks
   ---------------------------------------------------------------------------- */

/*! \addtogroup CAU_Register_Masks CAU Register Masks */
/*! \{ */

/* CASR Bit Fields */
#define CAU_CASR_IC_MASK                         0x1u
#define CAU_CASR_IC_SHIFT                        0
#define CAU_CASR_DPE_MASK                        0x2u
#define CAU_CASR_DPE_SHIFT                       1
#define CAU_CASR_VER_MASK                        0xF0000000u
#define CAU_CASR_VER_SHIFT                       28
#define CAU_CASR_VER(x)                          (((uint32_t)(((uint32_t)(x))<<CAU_CASR_VER_SHIFT))&CAU_CASR_VER_MASK)
/* CAA Bit Fields */
#define CAU_CAA_ACC_MASK                         0xFFFFFFFFu
#define CAU_CAA_ACC_SHIFT                        0
#define CAU_CAA_ACC(x)                           (((uint32_t)(((uint32_t)(x))<<CAU_CAA_ACC_SHIFT))&CAU_CAA_ACC_MASK)
/* CA Bit Fields */
#define CAU_CA_CAn_MASK                          0xFFFFFFFFu
#define CAU_CA_CAn_SHIFT                         0
#define CAU_CA_CAn(x)                            (((uint32_t)(((uint32_t)(x))<<CAU_CA_CAn_SHIFT))&CAU_CA_CAn_MASK)

/*! \} */ /* end of group CAU_Register_Masks */


/* CAU - Peripheral instance base addresses */
/*! Peripheral CAU base pointer */
#define CAU_BASE_PTR                             ((CAU_MemMapPtr)0xE0081000u)

/* ----------------------------------------------------------------------------
   -- CAU - Register accessor macros
   ---------------------------------------------------------------------------- */

/*! \addtogroup CAU_Register_Accessor_Macros CAU - Register accessor macros */
/*! \{ */


/* CAU - Register instance definitions */
/* CAU */
#define CAU_CASR                                 CAU_CASR_REG(CAU_BASE_PTR)
#define CAU_CAA                                  CAU_CAA_REG(CAU_BASE_PTR)
#define CAU_CA0                                  CAU_CA_REG(CAU_BASE_PTR,0)
#define CAU_CA1                                  CAU_CA_REG(CAU_BASE_PTR,1)
#define CAU_CA2                                  CAU_CA_REG(CAU_BASE_PTR,2)
#define CAU_CA3                                  CAU_CA_REG(CAU_BASE_PTR,3)
#define CAU_CA4                                  CAU_CA_REG(CAU_BASE_PTR,4)
#define CAU_CA5                                  CAU_CA_REG(CAU_BASE_PTR,5)
#define CAU_CA6                                  CAU_CA_REG(CAU_BASE_PTR,6)
#define CAU_CA7                                  CAU_CA_REG(CAU_BASE_PTR,7)
#define CAU_CA8                                  CAU_CA_REG(CAU_BASE_PTR,8)

/* CAU - Register array accessors */
#define CAU_CA(index)                            CAU_CA_REG(CAU_BASE_PTR,index)

/*! \} */ /* end of group CAU_Register_Accessor_Macros */


/*! \} */ /* end of group CAU_Peripheral */


/* ----------------------------------------------------------------------------
   -- CMP
   ---------------------------------------------------------------------------- */

/*! \addtogroup CMP_Peripheral CMP */
/*! \{ */

/*! CMP - Peripheral register structure */
typedef struct CMP_MemMap
{
    uint8_t CR0;                                     /*!< CMP Control Register 0, offset: 0x0 */
    uint8_t CR1;                                     /*!< CMP Control Register 1, offset: 0x1 */
    uint8_t FPR;                                     /*!< CMP Filter Period Register, offset: 0x2 */
    uint8_t SCR;                                     /*!< CMP Status and Control Register, offset: 0x3 */
    uint8_t DACCR;                                   /*!< DAC Control Register, offset: 0x4 */
    uint8_t MUXCR;                                   /*!< MUX Control Register, offset: 0x5 */
} volatile *CMP_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- CMP - Register accessor macros
   ---------------------------------------------------------------------------- */

/*! \addtogroup CMP_Register_Accessor_Macros CMP - Register accessor macros */
/*! \{ */


/* CMP - Register accessors */
#define CMP_CR0_REG(base)                        ((base)->CR0)
#define CMP_CR1_REG(base)                        ((base)->CR1)
#define CMP_FPR_REG(base)                        ((base)->FPR)
#define CMP_SCR_REG(base)                        ((base)->SCR)
#define CMP_DACCR_REG(base)                      ((base)->DACCR)
#define CMP_MUXCR_REG(base)                      ((base)->MUXCR)

/*! \} */ /* end of group CMP_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- CMP Register Masks
   ---------------------------------------------------------------------------- */

/*! \addtogroup CMP_Register_Masks CMP Register Masks */
/*! \{ */

/* CR0 Bit Fields */
#define CMP_CR0_HYSTCTR_MASK                     0x3u
#define CMP_CR0_HYSTCTR_SHIFT                    0
#define CMP_CR0_HYSTCTR(x)                       (((uint8_t)(((uint8_t)(x))<<CMP_CR0_HYSTCTR_SHIFT))&CMP_CR0_HYSTCTR_MASK)
#define CMP_CR0_FILTER_CNT_MASK                  0x70u
#define CMP_CR0_FILTER_CNT_SHIFT                 4
#define CMP_CR0_FILTER_CNT(x)                    (((uint8_t)(((uint8_t)(x))<<CMP_CR0_FILTER_CNT_SHIFT))&CMP_CR0_FILTER_CNT_MASK)
/* CR1 Bit Fields */
#define CMP_CR1_EN_MASK                          0x1u
#define CMP_CR1_EN_SHIFT                         0
#define CMP_CR1_OPE_MASK                         0x2u
#define CMP_CR1_OPE_SHIFT                        1
#define CMP_CR1_COS_MASK                         0x4u
#define CMP_CR1_COS_SHIFT                        2
#define CMP_CR1_INV_MASK                         0x8u
#define CMP_CR1_INV_SHIFT                        3
#define CMP_CR1_PMODE_MASK                       0x10u
#define CMP_CR1_PMODE_SHIFT                      4
#define CMP_CR1_WE_MASK                          0x40u
#define CMP_CR1_WE_SHIFT                         6
#define CMP_CR1_SE_MASK                          0x80u
#define CMP_CR1_SE_SHIFT                         7
/* FPR Bit Fields */
#define CMP_FPR_FILT_PER_MASK                    0xFFu
#define CMP_FPR_FILT_PER_SHIFT                   0
#define CMP_FPR_FILT_PER(x)                      (((uint8_t)(((uint8_t)(x))<<CMP_FPR_FILT_PER_SHIFT))&CMP_FPR_FILT_PER_MASK)
/* SCR Bit Fields */
#define CMP_SCR_COUT_MASK                        0x1u
#define CMP_SCR_COUT_SHIFT                       0
#define CMP_SCR_CFF_MASK                         0x2u
#define CMP_SCR_CFF_SHIFT                        1
#define CMP_SCR_CFR_MASK                         0x4u
#define CMP_SCR_CFR_SHIFT                        2
#define CMP_SCR_IEF_MASK                         0x8u
#define CMP_SCR_IEF_SHIFT                        3
#define CMP_SCR_IER_MASK                         0x10u
#define CMP_SCR_IER_SHIFT                        4
#define CMP_SCR_SMELB_MASK                       0x20u
#define CMP_SCR_SMELB_SHIFT                      5
#define CMP_SCR_DMAEN_MASK                       0x40u
#define CMP_SCR_DMAEN_SHIFT                      6
/* DACCR Bit Fields */
#define CMP_DACCR_VOSEL_MASK                     0x3Fu
#define CMP_DACCR_VOSEL_SHIFT                    0
#define CMP_DACCR_VOSEL(x)                       (((uint8_t)(((uint8_t)(x))<<CMP_DACCR_VOSEL_SHIFT))&CMP_DACCR_VOSEL_MASK)
#define CMP_DACCR_VRSEL_MASK                     0x40u
#define CMP_DACCR_VRSEL_SHIFT                    6
#define CMP_DACCR_DACEN_MASK                     0x80u
#define CMP_DACCR_DACEN_SHIFT                    7
/* MUXCR Bit Fields */
#define CMP_MUXCR_MSEL_MASK                      0x7u
#define CMP_MUXCR_MSEL_SHIFT                     0
#define CMP_MUXCR_MSEL(x)                        (((uint8_t)(((uint8_t)(x))<<CMP_MUXCR_MSEL_SHIFT))&CMP_MUXCR_MSEL_MASK)
#define CMP_MUXCR_PSEL_MASK                      0x38u
#define CMP_MUXCR_PSEL_SHIFT                     3
#define CMP_MUXCR_PSEL(x)                        (((uint8_t)(((uint8_t)(x))<<CMP_MUXCR_PSEL_SHIFT))&CMP_MUXCR_PSEL_MASK)
#define CMP_MUXCR_MEN_MASK                       0x40u
#define CMP_MUXCR_MEN_SHIFT                      6
#define CMP_MUXCR_PEN_MASK                       0x80u
#define CMP_MUXCR_PEN_SHIFT                      7

/*! \} */ /* end of group CMP_Register_Masks */


/* CMP - Peripheral instance base addresses */
/*! Peripheral CMP0 base pointer */
#define CMP0_BASE_PTR                            ((CMP_MemMapPtr)0x40073000u)
/*! Peripheral CMP1 base pointer */
#define CMP1_BASE_PTR                            ((CMP_MemMapPtr)0x40073008u)
/*! Peripheral CMP2 base pointer */
#define CMP2_BASE_PTR                            ((CMP_MemMapPtr)0x40073010u)

/* ----------------------------------------------------------------------------
   -- CMP - Register accessor macros
   ---------------------------------------------------------------------------- */

/*! \addtogroup CMP_Register_Accessor_Macros CMP - Register accessor macros */
/*! \{ */


/* CMP - Register instance definitions */
/* CMP0 */
#define CMP0_CR0                                 CMP_CR0_REG(CMP0_BASE_PTR)
#define CMP0_CR1                                 CMP_CR1_REG(CMP0_BASE_PTR)
#define CMP0_FPR                                 CMP_FPR_REG(CMP0_BASE_PTR)
#define CMP0_SCR                                 CMP_SCR_REG(CMP0_BASE_PTR)
#define CMP0_DACCR                               CMP_DACCR_REG(CMP0_BASE_PTR)
#define CMP0_MUXCR                               CMP_MUXCR_REG(CMP0_BASE_PTR)
/* CMP1 */
#define CMP1_CR0                                 CMP_CR0_REG(CMP1_BASE_PTR)
#define CMP1_CR1                                 CMP_CR1_REG(CMP1_BASE_PTR)
#define CMP1_FPR                                 CMP_FPR_REG(CMP1_BASE_PTR)
#define CMP1_SCR                                 CMP_SCR_REG(CMP1_BASE_PTR)
#define CMP1_DACCR                               CMP_DACCR_REG(CMP1_BASE_PTR)
#define CMP1_MUXCR                               CMP_MUXCR_REG(CMP1_BASE_PTR)
/* CMP2 */
#define CMP2_CR0                                 CMP_CR0_REG(CMP2_BASE_PTR)
#define CMP2_CR1                                 CMP_CR1_REG(CMP2_BASE_PTR)
#define CMP2_FPR                                 CMP_FPR_REG(CMP2_BASE_PTR)
#define CMP2_SCR                                 CMP_SCR_REG(CMP2_BASE_PTR)
#define CMP2_DACCR                               CMP_DACCR_REG(CMP2_BASE_PTR)
#define CMP2_MUXCR                               CMP_MUXCR_REG(CMP2_BASE_PTR)

/*! \} */ /* end of group CMP_Register_Accessor_Macros */


/*! \} */ /* end of group CMP_Peripheral */


/* ----------------------------------------------------------------------------
   -- CMT
   ---------------------------------------------------------------------------- */

/*! \addtogroup CMT_Peripheral CMT */
/*! \{ */

/*! CMT - Peripheral register structure */
typedef struct CMT_MemMap
{
    uint8_t CGH1;                                    /*!< CMT Carrier Generator High Data Register 1, offset: 0x0 */
    uint8_t CGL1;                                    /*!< CMT Carrier Generator Low Data Register 1, offset: 0x1 */
    uint8_t CGH2;                                    /*!< CMT Carrier Generator High Data Register 2, offset: 0x2 */
    uint8_t CGL2;                                    /*!< CMT Carrier Generator Low Data Register 2, offset: 0x3 */
    uint8_t OC;                                      /*!< CMT Output Control Register, offset: 0x4 */
    uint8_t MSC;                                     /*!< CMT Modulator Status and Control Register, offset: 0x5 */
    uint8_t CMD1;                                    /*!< CMT Modulator Data Register Mark High, offset: 0x6 */
    uint8_t CMD2;                                    /*!< CMT Modulator Data Register Mark Low, offset: 0x7 */
    uint8_t CMD3;                                    /*!< CMT Modulator Data Register Space High, offset: 0x8 */
    uint8_t CMD4;                                    /*!< CMT Modulator Data Register Space Low, offset: 0x9 */
    uint8_t PPS;                                     /*!< CMT Primary Prescaler Register, offset: 0xA */
    uint8_t DMA;                                     /*!< CMT Direct Memory Access, offset: 0xB */
} volatile *CMT_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- CMT - Register accessor macros
   ---------------------------------------------------------------------------- */

