butok/FNET/fnet_demos/common/startup/startup_mk60n512/headers/MK60X256VMD100.h
/*! \addtogroup MC_Register_Masks MC Register Masks */
/*! \{ */

/* SRSH Bit Fields */
#define MC_SRSH_JTAG_MASK                        0x1u
#define MC_SRSH_JTAG_SHIFT                       0
#define MC_SRSH_LOCKUP_MASK                      0x2u
#define MC_SRSH_LOCKUP_SHIFT                     1
#define MC_SRSH_SW_MASK                          0x4u
#define MC_SRSH_SW_SHIFT                         2
/* SRSL Bit Fields */
#define MC_SRSL_WAKEUP_MASK                      0x1u
#define MC_SRSL_WAKEUP_SHIFT                     0
#define MC_SRSL_LVD_MASK                         0x2u
#define MC_SRSL_LVD_SHIFT                        1
#define MC_SRSL_LOC_MASK                         0x4u
#define MC_SRSL_LOC_SHIFT                        2
#define MC_SRSL_COP_MASK                         0x20u
#define MC_SRSL_COP_SHIFT                        5
#define MC_SRSL_PIN_MASK                         0x40u
#define MC_SRSL_PIN_SHIFT                        6
#define MC_SRSL_POR_MASK                         0x80u
#define MC_SRSL_POR_SHIFT                        7
/* PMPROT Bit Fields */
#define MC_PMPROT_AVLLS1_MASK                    0x1u
#define MC_PMPROT_AVLLS1_SHIFT                   0
#define MC_PMPROT_AVLLS2_MASK                    0x2u
#define MC_PMPROT_AVLLS2_SHIFT                   1
#define MC_PMPROT_AVLLS3_MASK                    0x4u
#define MC_PMPROT_AVLLS3_SHIFT                   2
#define MC_PMPROT_ALLS_MASK                      0x10u
#define MC_PMPROT_ALLS_SHIFT                     4
#define MC_PMPROT_AVLP_MASK                      0x20u
#define MC_PMPROT_AVLP_SHIFT                     5
/* PMCTRL Bit Fields */
#define MC_PMCTRL_LPLLSM_MASK                    0x7u
#define MC_PMCTRL_LPLLSM_SHIFT                   0
#define MC_PMCTRL_LPLLSM(x)                      (((uint8_t)(((uint8_t)(x))<<MC_PMCTRL_LPLLSM_SHIFT))&MC_PMCTRL_LPLLSM_MASK)
#define MC_PMCTRL_RUNM_MASK                      0x60u
#define MC_PMCTRL_RUNM_SHIFT                     5
#define MC_PMCTRL_RUNM(x)                        (((uint8_t)(((uint8_t)(x))<<MC_PMCTRL_RUNM_SHIFT))&MC_PMCTRL_RUNM_MASK)
#define MC_PMCTRL_LPWUI_MASK                     0x80u
#define MC_PMCTRL_LPWUI_SHIFT                    7

/*! \} */ /* end of group MC_Register_Masks */


/* MC - Peripheral instance base addresses */
/*! Peripheral MC base pointer */
#define MC_BASE_PTR                              ((MC_MemMapPtr)0x4007E000u)

/* ----------------------------------------------------------------------------
   -- MC - Register accessor macros
   ---------------------------------------------------------------------------- */

/*! \addtogroup MC_Register_Accessor_Macros MC - Register accessor macros */
/*! \{ */


/* MC - Register instance definitions */
/* MC */
#define MC_SRSH                                  MC_SRSH_REG(MC_BASE_PTR)
#define MC_SRSL                                  MC_SRSL_REG(MC_BASE_PTR)
#define MC_PMPROT                                MC_PMPROT_REG(MC_BASE_PTR)
#define MC_PMCTRL                                MC_PMCTRL_REG(MC_BASE_PTR)

/*! \} */ /* end of group MC_Register_Accessor_Macros */


/*! \} */ /* end of group MC_Peripheral */


/* ----------------------------------------------------------------------------
   -- MCG
   ---------------------------------------------------------------------------- */

/*! \addtogroup MCG_Peripheral MCG */
/*! \{ */

/*! MCG - Peripheral register structure */
typedef struct MCG_MemMap
{
    uint8_t C1;                                      /*!< MCG Control 1 Register, offset: 0x0 */
    uint8_t C2;                                      /*!< MCG Control 2 Register, offset: 0x1 */
    uint8_t C3;                                      /*!< MCG Control 3 Register, offset: 0x2 */
    uint8_t C4;                                      /*!< MCG Control 4 Register, offset: 0x3 */
    uint8_t C5;                                      /*!< MCG Control 5 Register, offset: 0x4 */
    uint8_t C6;                                      /*!< MCG Control 6 Register, offset: 0x5 */
    uint8_t S;                                       /*!< MCG Status Register, offset: 0x6 */
    uint8_t RESERVED_0[1];
    uint8_t ATC;                                     /*!< MCG Auto Trim Control Register, offset: 0x8 */
    uint8_t RESERVED_1[1];
    uint8_t ATCVH;                                   /*!< MCG Auto Trim Compare Value High Register, offset: 0xA */
    uint8_t ATCVL;                                   /*!< MCG Auto Trim Compare Value Low Register, offset: 0xB */
} volatile *MCG_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- MCG - Register accessor macros
   ---------------------------------------------------------------------------- */

/*! \addtogroup MCG_Register_Accessor_Macros MCG - Register accessor macros */
/*! \{ */


/* MCG - Register accessors */
#define MCG_C1_REG(base)                         ((base)->C1)
#define MCG_C2_REG(base)                         ((base)->C2)
#define MCG_C3_REG(base)                         ((base)->C3)
#define MCG_C4_REG(base)                         ((base)->C4)
#define MCG_C5_REG(base)                         ((base)->C5)
#define MCG_C6_REG(base)                         ((base)->C6)
#define MCG_S_REG(base)                          ((base)->S)
#define MCG_ATC_REG(base)                        ((base)->ATC)
#define MCG_ATCVH_REG(base)                      ((base)->ATCVH)
#define MCG_ATCVL_REG(base)                      ((base)->ATCVL)

/*! \} */ /* end of group MCG_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- MCG Register Masks
   ---------------------------------------------------------------------------- */

/*! \addtogroup MCG_Register_Masks MCG Register Masks */
/*! \{ */

/* C1 Bit Fields */
#define MCG_C1_IREFSTEN_MASK                     0x1u
#define MCG_C1_IREFSTEN_SHIFT                    0
#define MCG_C1_IRCLKEN_MASK                      0x2u
#define MCG_C1_IRCLKEN_SHIFT                     1
#define MCG_C1_IREFS_MASK                        0x4u
#define MCG_C1_IREFS_SHIFT                       2
#define MCG_C1_FRDIV_MASK                        0x38u
#define MCG_C1_FRDIV_SHIFT                       3
#define MCG_C1_FRDIV(x)                          (((uint8_t)(((uint8_t)(x))<<MCG_C1_FRDIV_SHIFT))&MCG_C1_FRDIV_MASK)
#define MCG_C1_CLKS_MASK                         0xC0u
#define MCG_C1_CLKS_SHIFT                        6
#define MCG_C1_CLKS(x)                           (((uint8_t)(((uint8_t)(x))<<MCG_C1_CLKS_SHIFT))&MCG_C1_CLKS_MASK)
/* C2 Bit Fields */
#define MCG_C2_IRCS_MASK                         0x1u
#define MCG_C2_IRCS_SHIFT                        0
#define MCG_C2_LP_MASK                           0x2u
#define MCG_C2_LP_SHIFT                          1
#define MCG_C2_EREFS_MASK                        0x4u
#define MCG_C2_EREFS_SHIFT                       2
#define MCG_C2_HGO_MASK                          0x8u
#define MCG_C2_HGO_SHIFT                         3
#define MCG_C2_RANGE_MASK                        0x30u
#define MCG_C2_RANGE_SHIFT                       4
#define MCG_C2_RANGE(x)                          (((uint8_t)(((uint8_t)(x))<<MCG_C2_RANGE_SHIFT))&MCG_C2_RANGE_MASK)
/* C3 Bit Fields */
#define MCG_C3_SCTRIM_MASK                       0xFFu
#define MCG_C3_SCTRIM_SHIFT                      0
#define MCG_C3_SCTRIM(x)                         (((uint8_t)(((uint8_t)(x))<<MCG_C3_SCTRIM_SHIFT))&MCG_C3_SCTRIM_MASK)
/* C4 Bit Fields */
#define MCG_C4_SCFTRIM_MASK                      0x1u
#define MCG_C4_SCFTRIM_SHIFT                     0
#define MCG_C4_FCTRIM_MASK                       0x1Eu
#define MCG_C4_FCTRIM_SHIFT                      1
#define MCG_C4_FCTRIM(x)                         (((uint8_t)(((uint8_t)(x))<<MCG_C4_FCTRIM_SHIFT))&MCG_C4_FCTRIM_MASK)
#define MCG_C4_DRST_DRS_MASK                     0x60u
#define MCG_C4_DRST_DRS_SHIFT                    5
#define MCG_C4_DRST_DRS(x)                       (((uint8_t)(((uint8_t)(x))<<MCG_C4_DRST_DRS_SHIFT))&MCG_C4_DRST_DRS_MASK)
#define MCG_C4_DMX32_MASK                        0x80u
#define MCG_C4_DMX32_SHIFT                       7
/* C5 Bit Fields */
#define MCG_C5_PRDIV_MASK                        0x1Fu
#define MCG_C5_PRDIV_SHIFT                       0
#define MCG_C5_PRDIV(x)                          (((uint8_t)(((uint8_t)(x))<<MCG_C5_PRDIV_SHIFT))&MCG_C5_PRDIV_MASK)
#define MCG_C5_PLLSTEN_MASK                      0x20u
#define MCG_C5_PLLSTEN_SHIFT                     5
#define MCG_C5_PLLCLKEN_MASK                     0x40u
#define MCG_C5_PLLCLKEN_SHIFT                    6
/* C6 Bit Fields */
#define MCG_C6_VDIV_MASK                         0x1Fu
#define MCG_C6_VDIV_SHIFT                        0
#define MCG_C6_VDIV(x)                           (((uint8_t)(((uint8_t)(x))<<MCG_C6_VDIV_SHIFT))&MCG_C6_VDIV_MASK)
#define MCG_C6_CME_MASK                          0x20u
#define MCG_C6_CME_SHIFT                         5
#define MCG_C6_PLLS_MASK                         0x40u
#define MCG_C6_PLLS_SHIFT                        6
#define MCG_C6_LOLIE_MASK                        0x80u
#define MCG_C6_LOLIE_SHIFT                       7
/* S Bit Fields */
#define MCG_S_IRCST_MASK                         0x1u
#define MCG_S_IRCST_SHIFT                        0
#define MCG_S_OSCINIT_MASK                       0x2u
#define MCG_S_OSCINIT_SHIFT                      1
#define MCG_S_CLKST_MASK                         0xCu
#define MCG_S_CLKST_SHIFT                        2
#define MCG_S_CLKST(x)                           (((uint8_t)(((uint8_t)(x))<<MCG_S_CLKST_SHIFT))&MCG_S_CLKST_MASK)
#define MCG_S_IREFST_MASK                        0x10u
#define MCG_S_IREFST_SHIFT                       4
#define MCG_S_PLLST_MASK                         0x20u
#define MCG_S_PLLST_SHIFT                        5
#define MCG_S_LOCK_MASK                          0x40u
#define MCG_S_LOCK_SHIFT                         6
#define MCG_S_LOLS_MASK                          0x80u
#define MCG_S_LOLS_SHIFT                         7
/* ATC Bit Fields */
#define MCG_ATC_ATMF_MASK                        0x20u
#define MCG_ATC_ATMF_SHIFT                       5
#define MCG_ATC_ATMS_MASK                        0x40u
#define MCG_ATC_ATMS_SHIFT                       6
#define MCG_ATC_ATME_MASK                        0x80u
#define MCG_ATC_ATME_SHIFT                       7
/* ATCVH Bit Fields */
#define MCG_ATCVH_ATCVH_MASK                     0xFFu
#define MCG_ATCVH_ATCVH_SHIFT                    0
#define MCG_ATCVH_ATCVH(x)                       (((uint8_t)(((uint8_t)(x))<<MCG_ATCVH_ATCVH_SHIFT))&MCG_ATCVH_ATCVH_MASK)
/* ATCVL Bit Fields */
#define MCG_ATCVL_ATCVL_MASK                     0xFFu
#define MCG_ATCVL_ATCVL_SHIFT                    0
#define MCG_ATCVL_ATCVL(x)                       (((uint8_t)(((uint8_t)(x))<<MCG_ATCVL_ATCVL_SHIFT))&MCG_ATCVL_ATCVL_MASK)

/*! \} */ /* end of group MCG_Register_Masks */


/* MCG - Peripheral instance base addresses */
/*! Peripheral MCG base pointer */
#define MCG_BASE_PTR                             ((MCG_MemMapPtr)0x40064000u)

/* ----------------------------------------------------------------------------
   -- MCG - Register accessor macros
   ---------------------------------------------------------------------------- */

