butok/FNET/fnet_demos/common/startup/startup_mk60n512/headers/MK60X256VMD100.h
/*! \addtogroup WDOG_Register_Accessor_Macros WDOG - Register accessor macros */
/*! \{ */


/* WDOG - Register instance definitions */
/* WDOG */
#define WDOG_STCTRLH                             WDOG_STCTRLH_REG(WDOG_BASE_PTR)
#define WDOG_STCTRLL                             WDOG_STCTRLL_REG(WDOG_BASE_PTR)
#define WDOG_TOVALH                              WDOG_TOVALH_REG(WDOG_BASE_PTR)
#define WDOG_TOVALL                              WDOG_TOVALL_REG(WDOG_BASE_PTR)
#define WDOG_WINH                                WDOG_WINH_REG(WDOG_BASE_PTR)
#define WDOG_WINL                                WDOG_WINL_REG(WDOG_BASE_PTR)
#define WDOG_REFRESH                             WDOG_REFRESH_REG(WDOG_BASE_PTR)
#define WDOG_UNLOCK                              WDOG_UNLOCK_REG(WDOG_BASE_PTR)
#define WDOG_TMROUTH                             WDOG_TMROUTH_REG(WDOG_BASE_PTR)
#define WDOG_TMROUTL                             WDOG_TMROUTL_REG(WDOG_BASE_PTR)
#define WDOG_RSTCNT                              WDOG_RSTCNT_REG(WDOG_BASE_PTR)
#define WDOG_PRESC                               WDOG_PRESC_REG(WDOG_BASE_PTR)

/*! \} */ /* end of group WDOG_Register_Accessor_Macros */


/*! \} */ /* end of group WDOG_Peripheral */


/*
** End of section using anonymous unions
*/

#if defined(__CWCC__)
    #pragma pop
#elif defined(__IAR_SYSTEMS_ICC__)
    #pragma language=default
#else
    #error Not supported compiler type
#endif

/*! \} */ /* end of group Peripheral_defines */


/* ----------------------------------------------------------------------------
   -- Backward Compatibility
   ---------------------------------------------------------------------------- */

/*! \addtogroup Backward_Compatibility_Symbols Backward Compatibility */
/*! \{ */

/* No backward compatibility issues. */

/*! \} */ /* end of group Backward_Compatibility_Symbols */


#endif  /* #if !defined(MCU_MK60X256VMD100) */

/* MK60X256VMD100.h, eof. */
